// Напишите программу, которая принимает на вход 
// трёхзначное число и на выходе показывает вторую цифру этого числа.

/*
int CutNumber(int number)
{
    int dozens = number / 10;
    int unit = dozens %10;
    int result = unit;
    return result; 
}
int randNumber = new Random().Next(100, 1000);
int newNumber = CutNumber(randNumber);
Console.WriteLine($"New version of {randNumber} is {newNumber}");
*/

// Напишите программу, которая выводит третью цифру заданного числа

